<template>
  <div id="magong">
    <b-container>
      <b-row>
        <h1 class="text-center col-12 d-flex justify-content-center">M A G O N G</h1>
        <b-col class="col-6 col-md-3 mt-4 hover" v-for="(item, index) in items" :key="index">
          <b-link v-b-modal="'modal'+index" class="d-flex justify-content-center align-items-center">
            <b-img id="image" thumbnail fluid :src="item.img"></b-img>
            <p v-html="item.html"></p>
            <b-modal :id="'modal'+index" scrollable :title="item.title" ok-only>
              <b-img id="modal-img" fluid :src="item.modalimg" class="mt-3"></b-img>
              <p class="mt-4" v-html="item.text"></p>
            </b-modal>
          </b-link>
        </b-col>
      </b-row>
    </b-container>

    <b-col class="chevron-up-bg">
      <b-button pill href="#top"><font-awesome-icon :icon="['fas', 'chevron-up']" /></b-button>
    </b-col>

    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
      <path fill="#56B6DD" fill-opacity="0.7" d="M0,288L48,288C96,288,192,288,288,266.7C384,245,480,203,576,192C672,181,768,203,864,197.3C960,192,1056,160,1152,138.7C1248,117,1344,107,1392,101.3L1440,96L1440,320L1392,320C1344,320,1248,320,1152,320C1056,320,960,320,864,320C768,320,672,320,576,320C480,320,384,320,288,320C192,320,96,320,48,320L0,320Z"></path>
      <path fill="#56B6DD" fill-opacity="0.3" d="M0,96L60,106.7C120,117,240,139,360,133.3C480,128,600,96,720,80C840,64,960,64,1080,96C1200,128,1320,192,1380,224L1440,256L1440,320L1380,320C1320,320,1200,320,1080,320C960,320,840,320,720,320C600,320,480,320,360,320C240,320,120,320,60,320L0,320Z"></path>
    </svg>
  </div>
</template>

<script>
export default {
  name: 'magong',
  data () {
    return {
      items: [
        {
          img: './images/老街.jpg',
          html: '中央老街',
          title: '中央老街',
          text: '中央街是澎湖最早的聚落，習稱「街內」、「下街」，有十數條巷弄穿插其間，目前街內的建築，乃是依據明、清時代遺留的街貌修建而成，多處古蹟座落其中，著名的施公祠、萬軍井以及光緒元年建立的水仙宮，皆位於此。<br><br>中央老街位於澎湖馬公市內，是澎湖發展最早的一條街，因此也有「第一街」之稱，老街的發展可追朔到清乾隆33年，當年商店林立，琳瑯滿目的商品擺放於老街上，人潮接踵摩肩，十分熱鬧，盛況一直到光復後都還是以中央老街為馬公市區主要商業中心。<br><br>民國73年正式將中央老街列入「古蹟保存特定區」。到了民國83年，由澎湖老街居民組成「澎湖第一街振興協會」，由政府補助經費修復整建，將殘破的老街整頓成現今仿閩式建築風格，並搭上澎湖觀光熱潮，讓一度沉寂的中央老街再現當年榮景。<br><br>在縣政府的規劃之下聚集了許多有特色的商家，無論是住宿、美食、或是古老的遺跡都相當值得一遊。中央街內有許多值得一遊的景點，例如：四眼井、乾益堂中藥鋪、中央旅社、西河印刷廠…',
          modalimg: './images/老街.jpg'
        },
        {
          img: './images/四眼井.jpg',
          html: '四眼井',
          title: '四眼井',
          text: '位在澎湖老街北端，俗稱「頂街」，有一口四眼井，歷史非常非常悠久，大約在明朝中葉就有了，已有好幾百多年了；這口井最早期是一口相當大的大井，供馬公中央街一帶的人民使用，這口水井永遠水量豐沛，不曾枯竭，就算澎湖歷經多次的大乾旱，這口井依舊湧出沁涼甜美的水，供給了澎湖居民使用，而據傳說，澎湖中央街舊名稱為大井街，也是因為這口井而命名的。<br><br>四眼井又名四孔井或四穴井，井深5.6公尺，井寬1.8公尺，為了避免孩童大人不小心掉入井中，所以將井口加高；然後為了維護汲水的秩序，所以將井分成四個方向，加蓋井眼，每個井口的內徑剛好36公分，分東西南北四個方向，讓家家戶戶都可以方便排隊取水。過去是中央街一帶居民生活和飲用水的來源，現在轉型成為觀光。',
          modalimg: './images/四眼井.jpg'
        },
        {
          img: './images/萬軍井.jpg',
          html: '施公祠<br>萬軍井',
          title: '施公祠、萬軍井',
          text: '施公祠按「施將軍廟碑記」，可確證此廟係施琅平臺封靖海候後所建之生祠。道光年間加祀海璮殉職之官兵，故不專稱將軍廟，而改稱施公祠。，原名為「施將軍廟」，約建於清康熙23年(西元1684年)。<br><br>廟裡主祀施琅神像，以其任水師提督，有功于清廷，乃建施將軍以資紀念，道光二十三年後才易名施公祠。至今已有400多年以上歷史，為澎湖地區第三級古蹟。由於施琅將軍生前所為有功於清廷，所創下的豐功偉業更是不計其數，受朝廷賞識青睞之，因此清廷特設此廟，以表感念。<br><br>施公祠為街屋式狹長型合院之型態，建築構造由承重牆與山牆式木屋構架所混合構築而成。除入口外，其餘四面皆由密實的空間封閉為其特色，外埕亦不大。施公祠外側右前方，有一口井，原名媽宮大井，因有施琅禱於天后而得湧泉之傳說，又稱施將軍井、施井，以井水豐沛可供應萬軍飲用，也有師泉井、萬軍井的說法。該井依文化資產法公告為縣定古蹟。',
          modalimg: './images/萬軍井.jpg'
        },
        {
          img: './images/澎湖天后宮.jpg',
          html: '澎湖天后宮',
          title: '澎湖天后宮',
          text: '臺灣第一座媽祖廟就是位在澎湖的天后宮，文獻記載最早於1604年（明萬曆32年）就已建成，澎湖因為地處大陸和臺灣之間的特殊位置，成為以前外國政權如荷蘭人、日本人侵略臺灣的中繼站，臺灣由於是大陸的一部份，當然清朝政府不會坐視被佔領，所以先後派遣沈有容、施琅先後來台，在1683年由施琅奏請敕封為天后，成為臺灣歷史最悠久的天后宮廟宇，也是臺灣的一級古蹟。<br><br>這裡的建築是1922年重建的，當時聘請廣東潮州的師傅來主持建造，天后宮的建築特色具有潮州風格，和臺灣一般閩式風格不同，而正殿供奉的媽祖採金面，俗稱「金面媽祖」，在臺灣的媽祖廟中是絕無僅有的。<br><br>來到天后宮後面，會看到廟方展出兩個古物，第一個就是「沈有容諭退紅毛番韋麻郎等」碑記，這碑記是日治時代（1919年）重建過程中在地下發現的，印證1604年清朝沈有容來澎湖諭退荷蘭人韋麻郎的事蹟。<br><br>第二古碑年代為1681-1683年之間，因為風化嚴重，但可推斷出是當時清朝總督劉國軒為了感念天后宮的恩澤而刻出的石碑，也相當具有歷史價值。<br><br>天后宮採用「榫接」的建造技術，以傳統方式製作，廟宇不用一根釘子而是用木頭卡榫相接，要建造這樣的大型廟宇，僅使用榫接技術，是難得的技巧，還有在廟門前有一個大型八卦圖陣臺階，也是全臺灣僅有的，值得細細品味廟宇宗教藝術。',
          modalimg: './images/澎湖天后宮.jpg'
        },
        {
          img: './images/觀音亭休憩園區.jpg',
          html: '觀音亭<br>休憩園區',
          title: '觀音亭休憩園區',
          text: '觀音亭是澎湖首屈一指的古剎，位在青年活動中心旁；立於廟前，可遠眺西嶼落霞，景色極佳，早在400年前的澎湖廳志便有「四方煙波浩杳，景頗幽曠」 的美譽，也是「西瀛勝境」所在。素有【觀音夕照】之美譽。 觀音亭始建於清康熙35年1696年，主祀觀音菩薩。<br><br>觀音亭左邊即為著名的望潮亭，與介壽亭右下方的海豚亭及海水浴場正面的懷恩亭，同為西瀛勝景中「四亭濱海」的四亭。站在介壽亭可俯視西嶼落日美景，在望潮亭可遠眺臺灣海峽的潮起潮落，海豚亭正是洄在澎湖海濱的海豚表徵，懷恩亭則為紀念先總統 蔣公所建。就在觀音亭下方，在一處因海堤阻隔而風平浪靜的中央海域，成了天然的海水浴場，是游泳、戲水的好去處。目前於觀音亭新建了親水游憩區、國際風帆比賽中心、又有兒童遊樂場、腳踏車建康跑道、藍球場、溜冰場等公共娛樂設施，可以說是澎湖最美的地標，也是非常好的運動、休閒場所。于清晨與黃昏時分，為馬公居民休憩、運動的首選。<br><br>西瀛虹橋為澎湖海上花火節施放地點，可於施放日夜晚前來坐在觀音亭海豚亭附近的岸邊欣賞虹橋搭配煙火的華麗夜色。',
          modalimg: './images/觀音亭休憩園區.jpg'
        },
        {
          img: './images/西瀛虹橋.jfif',
          html: '西瀛虹橋',
          title: '西瀛虹橋',
          text: '西瀛虹橋位於澎湖縣馬公市的觀音亭海濱公園內，縣府耗資千萬在觀音亭外海堤搭建，於西元2004年完成，是澎湖地區第一座鋼拱橋。長200公尺、橋面淨寬4.6公尺、最高處橋底距海平面約15公尺，撘配紅、橙、黃、綠、藍、靛、紫等七彩霓紅燈的照明設備，夜間照明色彩正是虹的原子光譜，加上觀音亭向有西瀛勝境的美名，於是拱橋命名之。<br><br>西瀛虹橋與觀音亭的周邊美景互相結合，景緻看起來顯得浪漫愜意，當夜幕降臨，拱橋上七彩繽紛的霓虹燈更將點綴得更顯耀眼。<br><br>西瀛虹橋是當地民眾或遊客們喜愛運動散步、休閒賞景的場所。而這裡也是近年夏天澎湖海上花火節施放的地點，除了霓紅燈的顏色以外，加上煙火色彩的襯托，讓澎湖夜晚的天空增添了美麗，也是近幾年澎湖觀光形象的地標。',
          modalimg: './images/西瀛虹橋.jfif'
        },
        {
          img: './images/鎖港漁港.jpg',
          html: '鎖港漁港',
          title: '鎖港漁港',
          text: '位於澎湖縣馬公市鎖港里，在天然的內灣裡，有個屬第三類漁港的鎖港漁港，為馬公島南部之中心漁港；於民國42年5月闢建拋石式防波堤388公尺及碼頭240公尺，並設有加油站及護岸127公尺。66年度由中央加速計畫補助，完成碼頭及泊地浚渫等工程。<br><br>鎖港漁港具有加油站、儲冰庫、漁具整理場、拍賣場等項設施，可供補給，減少漁船至馬公補給之航程，成為馬公港之輔助港；陸上漁業設施有魚市場、冷凍庫、製冰廠、加油站、漁民活動中心等，設施完善，只有部份漁獲仍需至馬公漁港運銷。<br><br>在鎖港漁港內的魚市場是澎湖著名的魚販市場，每日上午和下午時段，漁船會出海去抓魚回到港邊販售，尤其在下午的魚販時段，澎湖各村都會有人特地跑來鎖港買魚呢。<br><br>在港旁邊的紫微宮，是澎湖廟宇神像最高的所在，主要祭祀紫微大帝；在飛機上就可以清楚看得到，其神像花費上億元，時間前後耗時十年打造完成，宮高七樓，是來澎湖鎖港不可錯過的景點；鄰近的還有鎖港南北石塔，是先民於鎖港築塔的，有鎮風止煞之意。',
          modalimg: './images/鎖港漁港.jpg'
        },
        {
          img: './images/菊島之星.jpg',
          html: '菊島之星',
          title: '菊島之星',
          text: '漁人碼頭前身是馬公第二漁港，以前是漁船、製冰廠的使用區域，到處都是油汙和魚腥味，隨意堆放的漁具和製冰馬達，後期在縣府整體規劃整治下，成為深具澎湖產業特色且最富潛力的水岸再發展區，如今成為澎湖居民散步以及旅客來澎必訪之地。漁人碼頭大致分成兩區塊，一個是以菊島之星為主的購物藝人區，一個是以彩繪油桶為主的休閒區域。碼頭上設有木棧道、濱港休憩木桌椅。<br><br>菊島之星是座用鋼筋混凝土建造的大郵輪，是由澎湖漁會花了1.2億打造的三層樓仿郵輪是建築，內部是漁會魚產品直銷中心，一樓是魚產、乾貨、伴手禮、手創藝品，二樓是海鮮餐廳，三樓有些船上設施供拍照參觀。<br><br>港區商圈再發展轉型，兼顧漁業生產與觀光休閒，成為水岸再發展區，沿著水岸木棧道歡賞，悠閒地徒步，結合夜間照明設計，呈現日夜不同風采。',
          modalimg: './images/菊島之星.jpg'
        },
        {
          img: './images/媽宮古城.jpg',
          html: '媽宮古城',
          title: '媽宮古城',
          text: '清朝光緒12年（1886年），閩浙總督楊昌濬及台灣巡撫劉銘傳親自來澎湖勘查地形之後，決定建造媽宮城作為防守的用途，接著由澎湖總兵吳宏洛負責監督製造，在次年光緒13年（1887年）12月動工，歷時1年10個月終於在清光緒15年（1889）年10月建設完成，這是清朝在台灣最後興建的一座城牆，而這做媽宮城的建設，也使得澎湖的軍事、經濟和行政中心合而為一。<br><br>媽宮城又稱為「澎湖城」、「光緒城」，是臺灣最晚的官建城池。清法戰役時澎湖輕易的被法軍攻陷，和議後臺灣巡撫劉銘傳與閩浙總督楊昌濬會籌防務，認為澎湖有建軍事防禦功能城池之必要，遂由當時澎湖總兵吳宏洛監造，於光緒15年（1889）竣工。<br><br>媽宮古城的規模，周圍有789.2丈2尺5寸，牆垛570個，牆身連接垛高1丈8尺，牆根地基3尺5寸，厚2丈4尺，媽宮古城共有六個城門，東門名叫朝陽門，小西門稱為順承門，南門稱為即敘門，北門名叫拱晨門，小南門稱為迎薰門，西門沒有設城樓。<br><br>現在順承門就是小西門，和一般城牆中雉堞會預留方孔作為觀測和射口的方式不同，順承門用澎湖當地所生產的火成岩砌牆身，上面接上老古石砌成的城垛，上下兩層中間砌一皮尺磚作為裝飾，再以牡蠣殼灰抹在表面作為保護的作用，目前澎湖媽宮城遺跡僅剩下順承門、大西兩座城門以及部分西段的城牆，而且這座順承門是目前媽宮古城殘蹟中唯一保存的門樓建築，也是二級古蹟。',
          modalimg: './images/媽宮古城.jpg'
        },
        {
          img: './images/馬公金龜頭礮臺文化園區.jpg',
          html: '金龜頭礮臺<br>文化園區',
          title: '馬公金龜頭礮臺文化園區',
          text: '金龜頭砲臺位於馬公市，在澎湖島西側的馬公半島極西，媽宮城西南門外，媽宮澳（今馬公灣）西南的龜頭山上，是拱衛清朝澎湖廳城的砲臺之一，與大山嶼舊稱「蛇頭」的風櫃尾蛇頭山東西斜對，共扼馬公港門，於民國九十年（2001年）11月21日公告為國定古蹟。<br><br>1886（清光緒12）年正月臺灣巡撫劉銘傳命澎湖鎮總兵吳宏洛建構金龜頭砲臺、西嶼西臺、西嶼東臺、大城北砲臺（拱北砲臺）四座新式阿姆斯壯後膛砲砲臺。<br><br>經歷過日本佔領與清、法戰爭，二次世界大戰後，由國軍接收進駐，原有的大砲已不具防禦威力，因此在民國40年代悉數報廢，該基地也改由陸軍澎湖防衛司令部天南營區（通信營）進駐，於砲臺南側增建一地下通道，可通往南側山涯下海岸，後來軍方釋出此地移交給澎湖縣政府。<br><br>配備有七、十、十二吋口徑之阿姆斯壯後膛砲各一門，為全澎湖戰力最大之砲臺，砲臺的型式與西嶼西臺、西嶼東臺、大城北砲臺相仿，皆為磚石砌三合土穹窿式構造。<br><br>入口處牌樓寫有「天南鎖鑰」的字樣，城垣為玄武岩疊砌及混凝土構造物，尚有種植當地植栽，如仙人掌、瓊麻等，構成砲臺地應有的獨特景觀。<br><br>現在的金龜頭礮臺四周的土垣、砲台掩體、砲台底座、入口處的牌樓皆保存良好，土垣則使用澎湖在地的玄武岩疊砌，以水泥作為黏結接合的材料。園區內的兵房，有原本進駐的國軍通信營部隊，各兵房都被使用的關係，故古蹟潮化程度得已降低，兵房內部均有隔間分隔成大小不等的空間，這些空間情況尚稱完好，部隊遷走後整建加已整理恢復，並加入不同軍士模型，讓古蹟重現古早味又帶點現代。<br><br>現在已開放參觀，園區內設置不同造型軍士模型與砲彈模型，還有在昔日清代指揮所旁設置砲彈模型，安置一門已退役的M1式40mm高射砲，並結合金龜頭砲台地下坑道歷史戰役展示工程，讓古蹟活化再利用，讓金龜頭砲臺成為澎湖新的文化旅遊亮點。',
          modalimg: './images/馬公金龜頭礮臺文化園區.jpg'
        },
        {
          img: './images/澎湖海洋地質公園中心.jpg',
          html: '海洋地質<br>公園中心',
          title: '澎湖海洋地質公園中心',
          text: '澎湖海洋地質公園中心，是澎湖縣政府針對地質公園所設置的，位於第三漁港旁，與馬公市公所只有一條街道之隔。地質中心內有地質公園的介紹，還有澎湖的自然保護區，和貓嶼海鳥保護區、七美石器工廠的分佈圖、澎湖地質年代表、世界各國地質公園、台灣地質公園、石材生活主題、澎湖特色景觀、玄武岩的介紹等等，非常豐富詳細。<br><br>內部空間雖然不大，卻分為15區，有：「澎湖玄武岩展示」、「澎湖特色景觀」、「玄武岩介紹」、「澎湖地質年代表」、「澎湖六大地質公園」、「澎湖的自然及海鳥保護區」、「七美史石器工廠」、「世界共同的資產」、「石材生活主題」、「視聽室」、「圖書與石材工藝品」及「互動益智活動」等。<br><br>特別的是地質中心的外觀主要是以石為主，走的是傳統與和式的風格，是非常有特色的建築。內部分成許多館區，裡頭也木製的樓梯，樓中樓層層往上去，可以站在較高的地方欣賞館內。裡頭也有許多地區是提供給小朋友的科學教學的喔！',
          modalimg: './images/澎湖海洋地質公園中心.jpg'
        },
        {
          img: './images/風櫃洞.jpg',
          html: '風櫃洞',
          title: '風櫃洞',
          text: '位在澎湖風櫃半島南端，過去被稱為「風櫃尾」，這裡因為澎湖特有的玄武岩柱狀節理十分發達，而且長年受到海浪的侵蝕，而形成了狹長的海蝕溝。海蝕溝的底部又被侵蝕成為海蝕洞，海蝕洞頂端有一道順著節理縫隙通到海蝕洞內的小孔。每個禮拜漲潮時間一來，海浪順著海蝕溝灌入海蝕洞，洞內的空氣受到大力的擠壓，常常會發出「呼…呼..」的聲音，這個聲音就好像以前人們生火使用的鼓風爐聲，所以風櫃洞最有名的稱呼就叫做「風櫃聽濤」，是澎湖縣聽海濤聲最棒的地點！<br><br>配合玄武岩的特殊地貌，在清晨或夕陽西下時候遠眺，相當壯麗，也有一種詩人之美。風櫃洞旁邊有兩層樓像貝殼般造型的可愛涼亭，可走上去欣賞整面海面的景色以及觀察地面上壯觀的玄武岩侵蝕地貌。',
          modalimg: './images/風櫃洞.jpg'
        },
        {
          img: './images/篤行十村眷村文化保存園區.jpg',
          html: '眷村文化<br>保存園區',
          title: '篤行十村眷村文化保存園區',
          text: '篤行十村是台灣最古老的眷村，在日治時期，日本馬公重砲兵大隊進駐後，陸續興建了軍事設施、官舍和宿舍，就是篤行十村的前身。「篤行十村」是跨越日據和中國兩個時代的歷史眷村，為全台最古老的眷村。本眷村曾有多位名人居住於此，如唱紅海峽兩岸的民歌「外婆的澎湖灣」已故歌手潘安邦和張雨生二人，即是在此眷村長大的，而二位著名歌手的舊居，目前已分別規劃成藝展空間「張雨生故事館」和「潘安邦紀念館」，更為眷村增添了更豐富的人文內涵。另外老演員胡錦亦曾是此眷村內「篤行幼稚園」的學生。因潘、胡二人父親在軍中階級較高，故此眷村亦曾被稱做為「將校眷舍」。<br><br>現今篤行十村走過風華，轉型古蹟觀光，全國最古老的「篤行十村」將轉化為「澎湖眷村文化園區」。2017年9月21日澎湖縣政府與沐聯構海灣建設開發股份有限公司合作開發，將全國最古老眷村-澎湖篤行十村轉型為文創園區及旅店貳拾貳隱巷。希望能串連帶動附近觀音亭、金龜頭礮臺、天后宮、馬公港滬區、第一、二、三漁港、澎湖新灣區等觀光景點發展。<br><br>除了部分房舍整修規劃為旅店以外，整個園區周邊建築與街道也重新修復改建，園區內規劃了景觀區：「眷村資訊站」、「張雨生故事館」、「百年雞蛋花」、「醞釀廣場」、「大榕樹」、「潘安邦紀念館」、「眷村遺址」、「伴愛小樹」…等。另有商店區：「湘東雜貨舖」、「小貳-two」、「居酒屋」、「五弄咖啡館」、「白雪冰菓室」。眾多特色景點與商店吸引了眾多民眾來參觀拍照，儼然成了文青打卡新地標。<br><br>遊客除了可以規劃在此住宿，體驗眷村建築以外，園區不定時的配合節慶活動策畫相關的藝文主題活動，帶動周邊的美食、古蹟、人文故事，彷彿搭乘了時光機回到過去，讓民眾更加了解在地眷村文化與歷史典故，感受當地早期純樸簡單的眷村生活模式。',
          modalimg: './images/篤行十村眷村文化保存園區.jpg'
        },
        {
          img: './images/張雨生.jpg',
          html: '張雨生<br>故事館',
          title: '張雨生故事館',
          text: '中央街，張雨生故事館是將歌手張雨生童年居住的眷村─篤行十村改建，由於空間狹小，縣府故將鄰棟建築20、18、16號一併納入整修，作為故事館進行整體佈展；館內擺設昔日傢俱以陳列與張雨生相關的文物，如張雨生照片、創作作品、家書、獎盃、事蹟、影片等，這些文物大部份都是由張雨生的親友及歌迷所提供，極具特別價值。<br><br>張雨生故事館將展覽主題分為四區，分別是張雨生的童年生活、求學成長、步入歌壇及媒體報導等四個主題區介紹張雨生在澎湖求學與居住的生活點滴。<br><br>出生於澎湖的創作才子張雨生，九歲前成長在澎湖馬公市歷史悠久的篤行十村，但卻又少為人知。如今以篤行十村為基礎眷村園區中，規畫了張雨生故事館，紀念這位創作才子。張雨生曾創作出不少膾炙人口的好歌，並以一首勵志歌曲「我的未來不是夢」成名，後因車禍逝世，享年三十一歲，留給歌迷們許多遺憾及追思。',
          modalimg: './images/張雨生.jpg'
        },
        {
          img: './images/澎湖海洋資源館.jpg',
          html: '澎湖<br>海洋資源館',
          title: '澎湖海洋資源館',
          text: '澎湖縣文化局附設的澎湖海洋資源館，分為A館與B館，A館展示內容有澎湖海洋之文化史、海洋生物演化史、澎湖的珊瑚資源、澎湖的岩石礦物資源、澎湖群島的地質地形、澎湖的潮間帶展示及影片的欣賞。B館展示內涵為傳統漁具、海洋牧場、漁村生活實景、漁船的演進、未來海底世界、澎湖的漁業種類、澎湖經濟性水產生物、澎湖海域經濟性水產生物資源分佈與漁撈方法、海底景觀等。<br><br>海洋資源館的創建，溯至民國76年由行政院文建會委託中研院張崑雄博士主持本館規劃，標示出本館主在闡揚地域性海洋資源及文化特色。於83年在鄭明修博士協助下，完成第一期工程。之後於84年起陸續辦理第二、三期工程，於民國86年4月正式開館啟用。<br><br>展示內容以澎湖海洋文化為主軸，包括有生物的演進、潮間帶漁作、沿近海漁業、漁村生活實景、生態保育與資源的永續利用等呈現。引領民眾探尋與發現澎湖海洋多元文化、海洋生態風貌、海洋生物多樣性、環境變遷與澎湖海洋資源的永續利用，以落實海洋文化教育紮根基礎，激發民眾投注保育海洋之新生活水。<br><br>票價資訊：<br>1.全票：30元&emsp;2.團體票：20元（10人以上團體）&emsp;3.半票：15元（持學生證之在校學生適用）&emsp;4.免費：65歲以上老人家、身心障礙者、身高110公分以下小朋友、持有觀光局核發之導遊證、領隊證者',
          modalimg: './images/澎湖海洋資源館.jpg'
        },
        {
          img: './images/北辰市場.jpg',
          html: '北辰市場',
          title: '北辰市場',
          text: '北辰市場是馬公市最大的市場，更是澎湖最大的市場，是生活採購的必需之地！<br><br>北辰市場一帶在早期被地方稱之為土城，民國六十六年因文康市場不敷使用，所以將此地規劃為新型態的市場，因為市場從南向北移，因此，人口亦逐漸向北聚集。民國七十二年開始籌劃興建，2樓層建築，基地約1038坪，共179個攤位，兩層樓式。建築本體一樓是販售各式蔬果、海鮮，二樓是肉品販售專賣區。於七十三年完工，目前為澎湖最大的市場；是縣民生活採購的必需之地。熱鬧的場景隨處可見，人潮絡繹不絕，攤販的叫賣聲此起彼落。<br><br>一個離島的菜市場，活絡的展現澎湖人依賴和自足性。馬公北辰市場是澎湖的心臟，是馬公市最重要的市集。占地廣大，裡面的攤販眾多，食材應有盡有。<br><br>市場內往來人潮眾多，而排隊的人潮也不少，從正餐到點心，幾乎樣樣餐食都是人氣王。簡單食材帶出新鮮美味，加上澎湖人熱情和藹的笑容與態度，北辰市場可是來澎湖，非來不可的地方啊。',
          modalimg: './images/北辰市場.jpg'
        },
        {
          img: './images/嵵裡沙灘.jpg',
          html: '嵵裡沙灘',
          title: '嵵裡沙灘',
          text: '位在澎湖南方嵵裡聚落西北邊有一座山丘，形狀很像古代官員所戴的烏紗帽，因此稱為「紗帽山，而嵵裡聚落就位在紗帽延伸出來的冠耳（台語稱為「匙」）上，因此有了「時內」和「嵵裡」的名稱。<br><br>嵵裡聚落裡的嵵裡沙灘也是澎湖相當受歡迎的景點之一，由於風積作用而形成的嵵裡沙灘範圍不大，在2008年澎湖馬公市公所重新整建為嵵裡休憩中心。嵵裡南邊濱臨大海，有一片由珊瑚及貝殼碎片所組成的白色沙灘。早期是居民牽網捕魚的漁場。<br><br>由珊瑚和貝殼沙構成的白色海灘，綿延一公里餘，是想體驗海岸風光不能錯過的景點。 嵵裡沙灘的沙子，在夕陽西下或是晨曦時，涼風徐徐，看見遠方蒔裡沙灘的美麗金黃緊色，美不勝收。 <br><br>嵵裡沙灘和其他澎湖的沙灘比起來坡度比較緩和，海浪也比較小，也有很多朋友會來這裡衝浪，蠻適合一家大小，尤其有小朋友的家庭來玩，想體驗澎湖第一的發呆亭和海灘美色，來嵵裡沙灘就對了！',
          modalimg: './images/嵵裡沙灘.jpg'
        },
        {
          img: './images/山水沙灘.jpg',
          html: '山水沙灘',
          title: '山水沙灘',
          text: '來到澎湖最美的山水沙灘，山水古時候有個有趣的地名，叫做「豬母落水」，由來是傳說古時候有一隻母豬跑到沙灘上，結果海中出現一隻大章魚，經過一番纏鬥，母豬還是被大章魚拖下海去，所以才稱為「豬母落水」，到了日治時代，改稱為「豬母水」，直到臺灣光復才改為「山水」地名。<br><br>山水沙灘綿延200多公尺，潔白沙灘，放眼望去是無止盡的藍色與白色，遼闊的視野令人心曠神怡，由於澎湖天然資源豐富，少遭受到人工的污染，所以沙子呈現美麗的金黃色，亦被稱為「黃金沙灘」。<br><br>山水綿延的金色沙灘、大片翠綠馬鞍藤攀附其間，金色陽光耀射蔚藍水面，山水沙灘海水極為清澈，當海水滑過腳邊，沁心冰涼的海水洗滌一身的疲累，海水是透明的，在陽光的反射下呈現粼粼波光。目前已成為遊客指名的旅遊勝地。',
          modalimg: './images/山水沙灘.jpg'
        },
        {
          img: './images/觀星公園.jpg',
          html: '觀星公園',
          title: '觀星公園',
          text: '觀星公園位在山水沙灘南岸東邊山水漁港一帶的觀音山，山水著名的浮潛區，就在山腳下的海濱。而觀星公園2008年整建完成，沿著步道往上爬，可眺望山水海港的觀星公園，山背則有草原和濱海小徑；在觀星公園內有三座涼亭，沿著步道走，可在這小憩再出發。在山背凹處，畫有春夏秋冬節氣的星象石碑參考表，這星儀槽區設計，可以遮蔽鎖港與山水海域夏季夜晚海上夜釣小管的船隻燈光，透過土牆遮擋海面上的漁火光害，讓觀星更加順暢，可以在這觀星廣場觀賞滿天星斗。<br><br>山水觀星公園，位在山水東側最高處，居高臨下可鳥瞰山水沙灘和山水漁港，蔚藍大海盡收眼底，另一頭可見鎖港與山水之間遼闊的海岸草原與沙之徑，寬闊的草原，夏天翠綠與冬天蕭黃都有獨特之美。在這裡可以晨間看日出，傍晚看夕陽，夜晚觀星。',
          modalimg: './images/觀星公園.jpg'
        },
        {
          img: './images/山水公園.jpg',
          html: '山水30<br>高地公園',
          title: '山水30高地公園',
          text: '山水三○高地沿線皆是軍事重地，後經地方積極爭取終獲軍方同意開放，並陸續增設高地公園人行徒步道路、遮陽設施、休憩座椅、解說設施、公廁、小型停車場等設施並配合既有營舍整修後，遊客可漫步而上，站在山頂至高點俯視整個山水海岸線壯麗海景。<br><br>山水三○高地公園的山型意象在白天營造360度視角皆可觀看，民眾並可於結構體下方自由穿梭，從山水沙灘亦可遠觀山型意象之美。而在夜間，結構體上裝設可變色照明燈具，形塑夜間山型意象的雄偉，搭配藉由燈光律動營造水波流動感覺，塑造出「山」與「水」互動感覺，表達山水在地形象及傳遞澎湖精神。<br><br>公園內並搭配景觀燈的設置，點亮三○高地公園，提供民眾夜間去處，並打造另一澎湖夜間新地標。未來山水沙灘將不只有白天的沙灘海浪，夜晚的燈光變換配合海浪聲，更讓人感受不同於白天的夜間氛圍。',
          modalimg: './images/山水公園.jpg'
        },
        {
          img: './images/菊苑休憩園區.jpg',
          html: '菊苑休憩<br>園區',
          title: '菊苑休憩園區',
          text: '由204號縣道分為南北兩側，北至東衛林區，南至興仁水庫，含括菊苑、蓮池、荷池、水土保持戶外教室、天人湖、雙龍潭、雙湖園、菜園濕地、菜園苗圃及榕園木棧步道等，園區內附設親子草坪活動區與公廁設施，提供遊園民眾更完善的活動場地與基礎服務設施；是個配合整體性、主題性的規劃設計和開發建置，構建出兼具生態保育、觀光休憩等多功能的大型園區。<br><br>園區裡樹木與綠地盎然，還種植櫻花、仙人掌、檸檬等樹種，目前分為森林保育區、水源涵養區、水土保持戶外教室、菜園苗圃、花海景觀區5個區域。近幾年澎湖縣政府農漁局配合春天，特別在園區推出波斯菊與薰衣草的春季花海景觀，色彩繽紛，來趟花海巡禮，配合園區內東衛林道、天人湖、榕園等區，美麗的湖光春色，為澎湖帶來別具的春意新氣象。<br><br>澎湖休憩園區景觀豐富環境自然優美，已成為民眾休閒及晨昏運動的最佳場所，也是遊客到澎湖踏青的好去處。',
          modalimg: './images/菊苑休憩園區.jpg'
        },
        {
          img: './images/澎湖生活博物館.jpg',
          html: '生活博物館',
          title: '澎湖生活博物館',
          text: '澎湖生活博物館係新設一座以「澎湖生活、文化、地方史及生態」為展示內容，以在地居民生活、情感及認同為依歸，深度詮釋澎湖歷史文化發展的博物館為目標，並建構為專業化縣級博物館，成為澎湖博物館事業發展之核心館。<br><br>2010年正式開館營運，是臺灣第一座城市博物館，全館展示標本文物、文獻、圖片、生態造景、縮景模型及身歷其境的聲光多媒體介紹，使展示內容更加生活化。<br><br>票價資訊：<br>1.全票：80元 &emsp;2.團體票：60元 &emsp;3.優待票：30元 &emsp;4.縣民團體優待票：20元 &emsp;5.本縣學生優待票：15元 &emsp;6.其他票種，請見其官網',
          modalimg: './images/澎湖生活博物館.jpg'
        },
        {
          img: './images/菜園3D彩繪情人灣.jpg',
          html: '菜園3D<br>彩繪情人灣',
          title: '菜園3D彩繪情人灣',
          text: '馬公菜園一直是澎湖牡蠣養殖重鎮，觀光淺力無窮，一旁的廢棄魚塭冷冷清清堆積了幾座牡蠣殼山實為可惜。<br><br>因此2016年初，經由澎湖國家風景區管理處重新規畫此廢棄魚塭，打造成旅遊新景點：3D彩繪情人灣。以最新３Ｄ繪畫技術，彩繪衝浪版、鯊魚及綠蠵龜等海洋生物，地板上繪有3D恐龍洞，並矗立「LOVE」彩繪意象牆，營造菜園最新意象。<br><br>進入3D彩繪情人灣映入眼簾的主視覺焦點就是大大的LOVE立體字，靠近一看會發現在LOVE字體的裡面也藏有玄機，配合原廢棄魚塭的地理環境，彩繪了許多藍色小魚和其他水中生物悠遊於LOVE中，看起來浪漫又動感、愜意十足。走到LOVE字體的背面，迎面就被色彩鮮艷的彩繪氣球所吸引，蹲坐在3D彩繪椅子上，彷彿就像被氣球帶著飄向天空，伴著鷹自由翱翔；一旁的綠蠵龜栩栩如生似乎要游出牆面來。<br><br>2017年更邀請曾擔任美術老師的旅外鄉親許景翔，3D彩繪創造新作品「澎福」出爐，以咾咕石古厝強調澎湖在地建築文化，仔細觀看會發現古厝上的石窗以「澎」字呈現隱喻蝙蝠「澎福」 ，細膩的描繪與深蘊的涵義表達了澎湖人的祈願，「澎福」意喻著澎湖有福。彩繪也特地配合周遭地理環境的輪廓與色彩，站在指定的角度觀看，「澎福」的草地、步道、魚塭、遠景與天空都和真實環境搭配得天衣無縫。',
          modalimg: './images/菜園3D彩繪情人灣.jpg'
        },
        {
          img: './images/澎湖孔廟.jpg',
          html: '澎湖孔廟',
          title: '澎湖孔廟（文石書院）',
          text: '文石書院是昔日澎湖唯一的書院，也是最古老的學校，創立於乾隆三十一年（1766年），後於中法戰爭中受到破壞。日治初期，文石書院被設立野戰醫院，醫院撤走後書院被重修改建為澎湖孔廟。<br><br>坐落在今馬公市新生路澎湖生活博物館旁，為澎湖教育的發源地。因澎湖盛產文石，乃以此命名為文石書院。初建之時裡面祀奉了魁星之神，所以又叫「魁星樓」，後來又經歷任數次重修；1895年地方人士為了保存中華民族固有文化，將文石書院改為孔廟；直到民國88年，澎湖縣政府編列預算重新修建，成為今日樣式，因此目前又稱為「澎湖孔廟」。<br><br>文石書院，進入大門，一眼就可看到圍牆邊高聳的石碑，施琅靖臺碑文字已遭磨平。文石書院的建築為清朝傳統式，為標準中國風味的雙層閣樓；其中包括大城殿及東廡、西廡暨大成門、櫺星門及崇聖祠等等，保留了傳統的建築風貌。',
          modalimg: './images/澎湖孔廟.jpg'
        },
        {
          img: './images/蔡廷蘭進士第.jpg',
          html: '蔡廷蘭<br>進士第',
          title: '蔡廷蘭進士第',
          text: '澎湖興仁蔡進士第位於今馬公市東南方興仁里上村，為澎湖進士蔡廷蘭高中進士後所建，自道光二十六年（1846年）至今。興仁蔡氏後裔蔡廷蘭，於道光二十四年（1844年）中式，成為澎湖本地的第一位，也是唯一的一位進士。<br><br>進士蔡廷蘭生於嘉慶六年（1801年），十三歲即以稚年補生員，後入學府，屢試屢中，補澎湖廳稟生。為人廉靜，好讀書，先後主崇文書院、引心書院及文石書院講習。道光十七年（1837年）秋試中舉人。<br><br>道光二十四年（1844年）春晉京會試，中進士，以即用知縣分發江西省。此後仕途多在大陸內地，任官累遷至同知，咸豐九年（1859年）以病歿於任所。蔡進士中進士後三年，即道光二十六年（1846年），回鄉祭祖，便在雙頭掛舊宅右邊建進士第，以光耀門楣。進士第的建築特色是門廊面寬四點五公尺，深進約三點三公尺，正立面為退凹式作法。<br><br>其廂房為馬背硬山式作法，屋面為硬山燕尾屋脊，為澎湖民宅中唯一有燕尾作法。宅第中其他建築作法及裝飾，亦頗為精緻。2013年，已有167年歷史的澎湖縣定古蹟「蔡廷蘭進士第」，在歷經5年，耗資千萬元修復後，正式對外開放參觀。',
          modalimg: './images/蔡廷蘭進士第.jpg'
        },
        {
          img: './images/桶盤嶼.jpg',
          html: '桶盤嶼',
          title: '桶盤嶼',
          text: '中央街，桶盤嶼位於澎湖本島西南方，距離馬公市中心西南方約七公里處，約20分鐘船程。島之形狀有如一倒蓋的「桶盤」，是標準的方山地形。在澎湖離島中，玄武岩石柱頗為壯觀的島嶼，周圍玄武岩柱狀節理十分發達且排列整齊著，因石景非常與眾不同，向有澎湖的黃石公園美譽，可沿環島水泥步道盡情瀏覽。<br><br>在其西南海岸的海蝕平台上，有玄武岩熔槳湧出所形成的同心圓孔洞，中央隆起的岩塊，有如一朵盛開的蓮花，故人稱「蓮花台」，這裡隨著潮汐海流漲退循環顯沒，是澎湖特樹的地形景觀。<br><br>沿著山壁的步道環環往上爬，一路上可以近距離的觀察桶盤玄武岩，整個看似山壁的景象，都是由玄武岩的「柱狀」所構成的，景象非常特殊，是前所未見的。在其東、南方的海崖下方，常可見到佈滿蜂巢狀孔洞的玄武岩塊落散落在海蝕平台附近，此種「蜂窩岩」當地人稱為「貓公石」，這蜂巢狀玄武岩也為海岸賞景增色不少。',
          modalimg: './images/桶盤嶼.jpg'
        },
        {
          img: './images/蓮花座.png',
          html: '蓮花座',
          title: '蓮花座',
          text: '蓮花座位於桶盤嶼西南方的海蝕平台上面，蓮花座其實是一個火山口的構造，因為四周經常被海水沖蝕，，所以凹陷，唯獨中央有一個突起的小山丘，從上方向下俯瞰，或是從遠處觀賞，就像是一朵盛開巨大的美麗蓮花一樣，所以又被稱作是蓮花座。<br><br>最特別是在退潮的時候，一旦海水退去，整個蓮花座都會顯露出來，從玄武岩石柱群上往下觀賞，就好像是冒出水的蓮花一樣，如果正好是黃昏的時間，再配上金色的餘暉，整個畫面真的是美不勝收呢！<br><br>近看退潮後的蓮花座外觀，是玄武岩構成的，外圍由玄武岩圍成圈圈，中間都是漲潮時候留下的海水，以及一些玄武岩斑駁的痕跡，但那絕對不是泥濘喔，而是真正的玄武岩，只是受到海水侵蝕而已。唯獨正中央那隆起的玄武岩小山丘，如同蓮花的花蕊一般，顯得特別醒目，附近還有適合在玄武岩附近生長的綠茵構成草皮，畫面很漂亮，非常美麗。<br><br>事實上，蓮花座是海底火山口，不過請放心，這並不是會噴發的火山類型，可以放心的觀光喔！黃昏的蓮花台，會被餘暉照得發亮，有機會一定要看看喔！',
          modalimg: './images/蓮花座.png'
        },
        {
          img: './images/青灣玄武岩.jpg',
          html: '青灣玄武岩',
          title: '青灣玄武岩',
          text: '澎湖群主要由玄武岩組成，係熔岩多次由地底裂隙湧出地表冷卻形成，目前最早的火山熔岩，約在一千八百萬年前寧靜噴發，大概在800萬年前中止火山運動。澎湖由玄武岩構成了方山地形，四周岩壁陡峭，長期經過風化、風蝕以及海蝕作用後，發展出各種獨特的地形景觀，加上岩體常會因熔岩急速收縮冷卻而產生張力，使岩石產生多角柱狀的破裂，此破裂面稱為柱狀節理。有平直、彎曲或各種方向的傾斜，成為澎湖玄武岩景觀中最具特色的風貌。<br><br>在馬公，往風櫃方向縣道201號公路段的左邊山頭，可以見到聳立在路旁的青灣柱狀玄武岩。澎湖的玄武岩因長時間的風化及侵蝕作用，展現出不同樣貌，而青灣這裡，便是其中一項最具風貌的柱狀玄武岩。<br><br>在青灣，不只可以觀賞壯麗磅礡、獨立的玄武岩，更是可以欣賞沿岸的風光哦。',
          modalimg: './images/青灣玄武岩.jpg'
        },
        {
          img: './images/虎井嶼.jpg',
          html: '虎井嶼',
          title: '虎井嶼',
          text: '澎湖縣為北回歸線經過的縣市之一，且位為台灣極西側(虎井嶼)。近年政府單位在現地設立兩個造型意象，於2016年完成此追日大道的景觀意象，全長約55公尺，寬4公尺，步道上裝飾各國特有文化風俗標誌彩色石板立體浮雕並標示北回歸線經過全球16國家。步道終點的雙手意象，配合太陽照射角度隨季節變化，夕陽位置於春分秋時位於正西，夏至日偏移至最北,冬至日偏移至最南，隨陽光變化景緻。<br><br>在東、西二山之間，略靠東山北岸附近有相當大的群落地基，其方格式排列之中隱約能看出不同房屋大小的格局，惟所在位置接近北方，其受夏天的颱風以及冬天東北季風的影響。',
          modalimg: './images/虎井嶼.jpg'
        },
        {
          img: './images/錠鉤嶼.jpg',
          html: '錠鉤嶼',
          title: '錠鉤嶼',
          text: '在雞善嶼東南方約1公里的海面上，可以看到四個由玄武岩岩礁組成的錠鉤嶼。由於岩漿流出後形成了各種不同方向的柱狀節理。再經過海蝕和風化作用，大自然將此地岩石雕塑的更加精緻奇特，頗有桂林山水的美名。起伏的地勢，造就成群的海蝕柱，在海蝕柱之間更形成「一線天」的奇景，這難得的景觀令人有「此景只應錠鉤有，澎湖他處無得尋」之感。<br><br>錠鉤嶼全島由緻密的柱狀玄武岩構成，顏色黝黑，與雞善嶼一樣，玄武岩之中常見含有橄欖石的團塊。在冬季時，島上的岩礁也和雞善嶼一般，都長有天然的紫菜，這些漁業產權都是屬於附近村莊的共同產業，也往往能為居民帶來一筆不小的財富。<br><br>由於本島屬於保留區範圍，人為干擾少。夏季時，近千隻的白眉燕鷗便選擇此處為繁殖地點，形成澎湖北海地區白眉燕鷗最重要的棲息地。搭船前往附近海域，均可輕鬆欣賞到白眉燕鷗群優雅的舞姿。',
          modalimg: './images/錠鉤嶼.jpg'
        },
        {
          img: './images/雞善嶼.jpg',
          html: '雞善嶼',
          title: '雞善嶼',
          text: '從湖西鄉的沙港村或北寮村等港口出發，位於北寮村東北方約4公里的海面上，有兩個方山台地的島嶼，四周海崖的玄武岩柱狀節理分明，退潮時這兩個島可以相連，原本這兩個島嶼是一熔岩台地，約誕生於1200萬年前，由於激烈的海蝕作用才分割成大、小兩個島嶼。在這兩個島嶼的玄武岩中均含有橄欖石團塊，可知當時熔岩是來自地底較深處。<br><br>大雞善嶼的東、南、西邊皆可以看到海蝕洞、海蝕溝等地形，東南方則有一處淺水沙灘。小雞善嶼是典型的玄武岩方山小島，長短高低、參差不齊的柱狀玄武岩屹立海中，有如一座超大的管風琴矗立碧海藍天中，六角形的節理面、稜角分明、鏗鏘有力，是蒞澎賞岩、賞鳥的最著名景點。<br><br>夏季時，來雞善嶼繁殖的紅燕鷗數量居北海之冠，每年都有一、兩千隻選擇在島上棲息。近年來，澎湖縣野鳥學會在雞善嶼進行繫放研究時，根據紅燕鷗腳上的足旗得知，這些紅燕鷗是來自澳洲的東北方。同樣地，澳洲在冬季的繫放工作也發現來自澎湖的紅燕鷗，而且十多年前澎湖鳥會繫放的紅燕鷗，也再回到了澎湖繁殖。可見紅燕鷗每年春、秋兩季便會千里迢迢的往返於澎湖與澳洲之間。<br><br>保護島嶼景觀，也是保護野生動物的最好方法，近年來隨著觀光的發達，雞善嶼已成為東海旅遊的新據點，玄武岩與燕鷗的對話，就如同一幅和諧的大自然景象。',
          modalimg: './images/雞善嶼.jpg'
        }
      ]
    }
  },
  methods: {
    hover (event) {
      this.show = (event)
    }
  }
}
</script>
