<template>
  <div id="wangan">
    <b-container>
      <b-row class="mb-5 mt-3">
      <h1 class="text-center col-12 d-flex justify-content-center">W A N G A N</h1>
        <b-col class="col-6 col-md-3 mt-4 hover" v-for="(item, index) in items" :key="index">
          <b-link v-b-modal="'modal'+index" class="d-flex justify-content-center align-items-center">
            <b-img id="image" thumbnail fluid :src="item.img"></b-img>
            <p v-html="item.html"></p>
            <b-modal :id="'modal'+index" scrollable :title="item.title" ok-only>
              <b-img id="modal-img" fluid :src="item.modalimg" class="mt-3"></b-img>
              <p class="mt-4" v-html="item.text"></p>
            </b-modal>
          </b-link>
        </b-col>
      </b-row>
    </b-container>

    <b-col class="chevron-up-bg">
      <b-button pill href="#top"><font-awesome-icon :icon="['fas', 'chevron-up']" /></b-button>
    </b-col>

    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
      <path fill="#56B6DD" fill-opacity="0.7" d="M0,288L48,288C96,288,192,288,288,266.7C384,245,480,203,576,192C672,181,768,203,864,197.3C960,192,1056,160,1152,138.7C1248,117,1344,107,1392,101.3L1440,96L1440,320L1392,320C1344,320,1248,320,1152,320C1056,320,960,320,864,320C768,320,672,320,576,320C480,320,384,320,288,320C192,320,96,320,48,320L0,320Z"></path>
      <path fill="#56B6DD" fill-opacity="0.3" d="M0,96L60,106.7C120,117,240,139,360,133.3C480,128,600,96,720,80C840,64,960,64,1080,96C1200,128,1320,192,1380,224L1440,256L1440,320L1380,320C1320,320,1200,320,1080,320C960,320,840,320,720,320C600,320,480,320,360,320C240,320,120,320,60,320L0,320Z"></path>
    </svg>
  </div>
</template>

<script>
export default {
  name: 'wangan',
  data () {
    return {
      items: [
        {
          img: './images/望安曾家古厝.jpg',
          html: '曾家古厝',
          title: '望安曾家古厝',
          text: '望安花宅聚落是澎湖地區保存較完整的傳統聚落之一。<br><br>漢人300多年前移民到此，其地形周圍山丘環繞，宛如花瓣環繞著花心；於是在花心、山仔尾頂附近墾地築屋，因此名為「花宅」。台灣光復後，以地理位置在望安鄉本島四個村落的中央，而更名為「中社」村。<br><br>花宅又稱為中社村，位於望安島中央偏西，因形成該村的兩個主要聚落大、小花宅中央有一處小丘，當地居民稱為「花心」，民國35年，改名為中社村，其中最有名古厝是窗戶有曾字的曾家古厝，這間華麗的古厝就是聚落中保存最完整的。<br><br>2003年在曾家所有家族成員同意下依照原本的建築主體進行翻修，並且擬訂公約要後代子孫未來進行修復時必須確保完整的風貌。門前的曾字紅磚窗明顯表達出本棟建築的主人姓氏。<br><br>正面門樓採取「倒吞吟」的模式，請門樓上頭處理成平坦的磚坪，通常用作曬魚乾或花生之用。正立面的鳥踏之上裝飾有日式5x5花磚，極其典雅華麗，且牆壁的石材有別於澎湖大部分古厝是用咾咕石砌成，曾家古厝是以玄武岩所砌。正面的窗戶充滿書卷味道的書卷窗造型，曾家後頭的小山丘就是花宅這個古地名由來的「花心」所在。',
          modalimg: './images/望安曾家古厝.jpg'
        },
        {
          img: './images/東吉嶼.jpg',
          html: '東吉嶼<br>燈塔',
          title: '東吉嶼燈塔',
          text: '東吉島位於望安島之東南側，為早期澎湖往台灣之海運中繼站，素以水路兇險緊臨黑水溝著稱；東吉嶼面積約1.5平方公里，為澎湖東南四島中面積最大者。由於交通不便，一般都是由馬公或望安雇船來到東吉漁港停靠。<br><br>興建於日明治44年，民國前1年（西元1911年）興建的東吉嶼燈塔，位於澎湖縣東吉嶼北角崖頂，原為鐵造圓筒形燈塔，民國27年改建為鋼筋混凝土圓塔，外表漆黑白相間的平行橫條紋。東吉嶼是澎湖群島中與台灣本島距離最近的一座島嶼，螺旋狀的急湍暗流來回其間，被稱為黑水溝，附近海域觸礁沉沒的船隻甚多，早期東吉嶼東邊的黑水溝被航海人視為鬼域，是最危險的區域。<br><br>東吉燈塔，為航行於黑水溝的船隻點亮漆黑的夜。東吉燈塔西北方海域有鋤頭嶼，冬季盛產紫菜。北側海岸海崖垂直，附近有一巨大的海蝕洞和海蝕柱，在海崖下方經風化的玄武岩塊，從各種不同的角度觀賞形狀各不相同，有如海上巨人。東北角有日據時代興建的砲兵房舍遺址，東吉人稱為「兵厝」。此地一望無際的青青草原，許多野放的羊兒四處奔跑。',
          modalimg: './images/東吉嶼.jpg'
        },
        {
          img: './images/花嶼.png',
          html: '花嶼',
          title: '花嶼、花嶼燈塔',
          text: '花嶼位在望安島西北方偏南，是澎湖縣最西方的島嶼，也是全台的極西，最高處約53公尺。<br><br>花嶼地形與澎湖其他島嶼相似，就地質卻是不同，其他島嶼以玄武岩為主，而構成花嶼的岩石主要為安山岩，是由九千萬年前到五千萬年前形成，為澎湖群島最古老的島嶼；在長期的風化作用下，刻劃出了不同的岩石景觀。<br><br>在退潮時，花嶼的東南側海蝕礁石上，可看到傳說中「仙腳石印」的左腳，與望安嶼天台山的右腳相呼應；島上還有夫妻石（情人石）、石觀音、石猴、老翁石...等岩石景觀。<br><br>為在花嶼山頂的花嶼燈塔，是花嶼附近的主要地標，日本人因軍事上具重要地位而興建，於民國28年（西元1939年）完工，塔身為鋼筋混凝土白色圓形燈塔，塔高12.5公尺，是台灣最西的燈塔；裝有四等電石氣閃光燈，每五秒閃白光一次，光力1600支燭光。',
          modalimg: './images/花嶼.png'
        },
        {
          img: './images/西嶼坪.jpg',
          html: '西嶼坪',
          title: '西嶼坪',
          text: '西嶼坪嶼位於澎湖南海，行政名稱為西坪村，為望安鄉所管轄，是望安鄉的離島（相距五浬）。距離澎湖縣行政中心馬公市約二十三浬，航程七十五分鐘。<br><br>澎湖南方四島中的西嶼坪嶼位於東嶼坪嶼的西北方，面積0.3477平方公里，海拔高度最高點約42公尺，是一略呈四角型的方山地形，因無法築港，僅只有一條碼頭位於島嶼的東南方。因地形關係使得村落建築無法聚集於港口，因此選擇坡頂平坦處來定居發展，聚落位於島中央的平台上形成另一種特殊景觀與人文特色。<br><br>海崖與海蝕溝：<br>西嶼坪嶼的東南海岸，寬廣且高聳佇立的海崖地形顯而易見。<br><br>華娘廟：<br>西嶼坪嶼的居民多已外移，多數民宅亦因年久失修而毀損，村落的信仰中心─華娘廟為保存最完整的建築。華娘廟主要供奉主神武帥、媽祖、三太子、陳將軍等諸神，其規模與外觀相較其它島嶼的廟宇雖略顯失色，但從金爐及廟宇建築設計中，仍可回溯當年新建落成的過往輝煌。<br><br>聚落與菜宅：<br>由碼頭通往內陸聚落的道路，是一段約50公尺長的「好漢坡」，通過斜坡的考驗，就能看到以硓石、玄武岩堆疊而成的澎湖傳統古厝，由於島上無避風山坳，因此聚落多設於台地低窪處。西嶼坪嶼居民幾乎已遷居外地，古厝多呈現荒廢毀損的狀態，少數仍保存完整的，是村民為了能在廟會時回老家暫住，每年定期回鄉整理的成果。<br><br>土地公廟：<br>島嶼北側座落著坐北朝南，與碼頭旁的華娘廟分居北南的土地公廟，用來鎮守北方煞氣，避邪庇護村莊，土地公廟旁的海岸景觀可見火山角礫岩組成的地質及遠眺頭巾與鐵砧。<br><br>後山礫灘：<br>西嶼坪嶼村落多集中於南端，相對的北端建置較少，因此地質地形景觀較南端更為豐富精彩，可見由大片礫灘組成的海岸。在礫灘左側處可見一「小鐵砧」，遠眺能見到頭巾。',
          modalimg: './images/西嶼坪.jpg'
        },
        {
          img: './images/綠蠵龜觀光保育中心.jpg',
          html: '綠蠵龜觀<br>光保育中心',
          title: '綠蠵龜觀光保育中心',
          text: '在潭門港旁，有座流線型的建築，豎立在望安的東南方；館內硬體設施很完善，館內目前分：綠蠵龜介紹區、龜與人生態展示區、海鳥介紹區以及南海旅遊介紹等。<br><br>在展示廳入口處有一特別的「好善堂」石碑，碑文記載著以前望安地區士紳為保護海龜、耕牛而募款，立碑明文以津貼獎勵居民矜憐生命、同時報請官府准以違者重罰，以示恩威並重。現在此碑文已成為早期先民對於海龜生態保育的重要見證。<br><br>進入館內，望安自然生態盡收眼底，燕鷗、保育生物紛紛登場。最重要的「綠蠵龜」，館內有各龜種的特徵辨別及分布環境等資訊介紹，及海龜與民間祈福活動「上元乞龜」、海洋生態、歷史文化皆可於館內了解。<br><br>中心的興建目的在於提供設備與資源，供學術單位進行駐站的研究工作，同時『綠蠵龜觀光保育中心』的設立，不僅為澎湖望安的綠蠵龜生態研究提供一處完美的研究站，且亦為一現地生態教育中心。<br><br>全館展示朝向環境型、情境式的設計概念出發，提供一處感性、知性兼俱的生態教育環境。透過生物的形體模型，結合與觀眾互動式操作，使學習充滿驚奇與滿足的樂趣，更能達到寓教於樂的功能。<br><br>票價資訊：<br>1. 全票：每人50元。 &emsp;2. 半票：3~12歲小朋友、65歲以上的長者。 &emsp;3. 免費：望安與七美當地居民及3歲以下的幼兒、身心障礙者（持證件）。',
          modalimg: './images/綠蠵龜觀光保育中心.jpg'
        },
        {
          img: './images/頭巾嶼.jpg',
          html: '頭巾嶼',
          title: '頭巾嶼',
          text: '頭巾嶼名稱最早出現於杜臻的《澎湖臺灣紀略》，在西嶼坪北北西方約1.9公里的地方。周圍364公尺，面積0.46公頃，附近大約有十個小礁，退潮時面積為3.86公頃。其中較大的岩礁有六個，全島由北面海上眺望，像是古代包頭的頭巾，因此而得名。高拱乾《臺灣府志》則稱：「頭巾嶼形如角巾。」頭巾地勢較為陡峭，其最高點為49公尺，周圍岩礁眾多，北邊有一礁名「頭巾仔」，高約6.1公尺；南邊有一礁名「鳥仔代仔」，高約2.8公尺；東、西兩邊有許多形似相連的小礁，均已經成為各種燕鷗候鳥棲息繁殖的場所，如蒼燕鷗、白眉燕鷗等，冬季時盛產紫菜。',
          modalimg: './images/頭巾嶼.jpg'
        },
        {
          img: './images/鴛鴦窟.jpg',
          html: '鴛鴦窟',
          title: '鴛鴦窟、藏軍洞',
          text: '鴛鴦窟該處景點具有地理、歷史價值，東西向的河谷地形，亦為一處海釣場。<br><br>附近因河谷地形，有不少的淺水井；在二次大戰時，也是望安人的防空洞，在此曾挖掘多處山洞做為防空洞，因時間過往與大自然力量，這些防空洞多數皆已坍塌。<br><br>鴛鴦窟的外圍沙灘純潔寧靜，而外海則有狀似馬鞍的馬鞍山嶼為屏障，兩者相隔約600公尺之遠。<br><br>鴛鴦窟中的「藏軍洞」是該區殘存的歷史遺跡；在二次大戰時日軍奴役望安、將軍兩島居民，挖鑿而成，做為魚雷快艇和特攻隊員的寢室，在工程時將完成時，日本宣布無條件投降，基地因此廢棄，多處洞穴皆已崩塌，僅剩遺跡。',
          modalimg: './images/鴛鴦窟01.jpg'
        },
        {
          img: './images/天台山.jpg',
          html: '天台山',
          title: '天台山',
          text: '天台山位於澎湖的望安島上，高約53公尺，是望安島的最高點，也是澎湖第三高山。擁有澎湖最古老的珍貴玄武岩地質，山型地質皆由微輝長斑岩所組成。由於天台山所在地理位置的優勢，山頭視野遼闊，可遠眺澎湖諸島，西方海面有花嶼，南方有東、西嶼坪，更南為七美島，東南則有東吉與西吉、北方則為虎井嶼、澎湖本島等。<br><br>望安天台山附近是澎湖著名文石產地，四周草原平坦，可見有牛羊漫步，美景渾然天成。<br><br>天台山為眺望望安本島和對岸花嶼最佳地點。在西側海崖下有壯觀的玄武岩景觀，依循步道下至西邊海岸，可發現一處高達30公尺海蝕洞奇景，微灰長斑岩的節理之美與虎井、桶盤兩島之柱狀玄武岩景觀截然不同。<br><br>天台山西方海崖秀麗，海崖頂上有因風化而成的一處足形凹陷面，傳說是呂洞賓的腳印，故稱「仙腳步」。在海崖上端看到壯闊的海蝕溝與海蝕洞地形是一大享受，沿著崖頂山路而下，海邊微輝長斑岩的片狀節理，因受到風化和海蝕的結果，形成不規則的片狀節理破裂面，樣式多變，有如「節理花」的特殊景觀。<br><br>天台山上建有木棧道和涼亭，提供攀登天台山頂和休息遮陽。',
          modalimg: './images/天台山.jpg'
        },
        {
          img: './images/網垵口沙灘.jpg',
          html: '網垵口沙灘',
          title: '網垵口沙灘',
          text: '網垵口沙灘位在望安南端，U字形開口，是個貝殼沙灘，潔淨細白的沙灘綿延約一公里長，是夏日戲水的絕佳去處。沙灘草地是綠蠵龜上岸產卵棲地，已劃設為綠蠵龜產卵棲地保護區。<br><br>早期由於當地漁船停靠於此，在沙灘上曬網、補網，以及撒網捕魚之情景，故稱之為網垵口，現已無船隻停泊，而成為當地孩童與遊客戲水的天堂。<br><br>「網」是望安的舊稱也是望安島南方的最大聚落。聚落東側的網垵口是一處弧形海灣即在仙史宮前，因為是早期漁民牽網的沙灘而得名。<br><br>網垵口是望安傳統的魚場，早期在沙灘上可見曬網、補網、灑網捕魚等情境，這裡海域亦為古時台、澎、厦間交通必經處，冬季北風強勁，不利航行，船舶常停泊該海域，待海風稍緩再繼續前進。目前已無船隻停泊，以成為當地和遊客戲水的地方；夏日風平浪靜時，是游泳戲水的絕佳去處。<br><br>潔白沙子、蔚藍海水、以及寧靜空氣的美麗沙灘，適合戲水、游泳、賞景、聽濤及觀星，還有牽罟活動。<br><br>寧靜、清澈海水、金黃沙灘，想體驗網垵口沙灘的早晚不同的美景，建議在望安留宿一晚，這裡海域的海水色調一日數變，因此被戲稱為「調酒海灘」。',
          modalimg: './images/網垵口沙灘.jpg'
        },
        {
          img: './images/貓嶼.jpg',
          html: '貓嶼',
          title: '貓嶼',
          text: '貓嶼位於澎湖望安島西南方約16公里，包括兩座島嶼，因形狀像兩隻貓蹲伏而被稱大貓嶼和小貓嶼。島嶼為玄武岩組成，面積約10公頃。小貓嶼座落於大貓嶼東方，在退潮時有一海溝和大貓嶼相連。大貓嶼最高處70公尺，為澎湖群島的最高點，北端的海崖有貫穿大貓嶼的巨大海蝕拱門，拱門出口在大貓嶼西邊海蝕洞，在退潮時才能浮現。<br><br>貓嶼行政區劃屬澎湖縣望安鄉，屬於無人島，是由大、小貓嶼和一些岩礁組成，位在望安嶼西南方約16公里的海域，遠觀像似兩隻貓俯臥在海面上，故而命名；海拔高度約為70-79公尺，是澎湖群島的最高峰。<br><br>過去有軍方和漁民活動紀錄。澎湖縣政府於1991年將大、小貓嶼依《野生動物保育法》公告為貓嶼海鳥保護區，為臺灣第一個野生動物保護區，除陸域面積約10公頃之外，保護區包括陸地向外延伸100公尺的海域部分，總面積達36.2公頃。貓嶼是亞洲最大的玄燕鷗繁殖地區，其他像白眉燕鷗、鳳頭燕鷗與蒼燕鷗也都會在島上繁殖。保護區雖嚴禁任意登島，但在夏季燕鷗繁殖季節仍可搭船至週邊海域欣賞。<br><br>大小貓嶼陸域面積約10公頃大小，地勢峻峭，四面都是陡岩峭壁，而大貓嶼是自地表冒出的巨型岩脈，地處較小貓嶼高聳，而小貓嶼位在大貓嶼的東方，退潮時有一寬約10公尺的海溝相隔，在一側還有一海蝕平台，而周圍岩礁散布、海流湍急，船隻不易接近也不易通過。<br><br>該區域岩層上層皆由玄武岩構成，柱狀節理多呈彎曲狀；下層則由火山角礫岩組成，有著奇特壯觀的火山岩地質地形特色，另外貓嶼在民國80年（1991）公告、民國86年（1997）修正為「澎湖縣貓嶼海鳥保護區」。<br><br>因列為「澎湖縣貓嶼海鳥保護區」，島上所棲息的鳥類眾多，根據記錄共有20幾科45-55種鳥類，以玄燕鷗與白眉燕鷗最多，約佔總數的九成。每當3月至9月的鳥類繁殖季到來，成群的海鳥就在會這裡繁殖、覓食，數量高達上萬隻，這樣的場景令人讚嘆。<br><br>貓嶼列入「海鳥保護區」，一般遊客無法登島，只能進行島嶼週邊海域巡航欣賞，也禁止各種騷擾海鳥及破壞生態環境之行為；如需登島，必須申請核可，方可登島進行調查作業。',
          modalimg: './images/貓嶼.jpg'
        },
        {
          img: './images/將軍嶼.jpg',
          html: '將軍嶼',
          title: '將軍嶼',
          text: '將軍澳以矽質玄武岩為主，表面即為平坦，是屬於典型的玄武岩方山，和望安嶼僅一海浬之遠，航程約5分鐘。早年因採集珊瑚、文石而繁榮富庶，漁港街道上小樓房櫛比鱗次，而有「小香港」之美名。此島也是澎湖少數在早年就開始建有樓房的地區，故這裡二、三、四樓的樓房很多，另這裡亦有為數極多的窄巷老房，有著傳統的柑仔店。<br><br>現在島民多以捕魚為生，港邊低矮老舊的漁村風情，澎湖海域絕美的珊瑚與海底生態，因為愛護愛惜得以保持。<br><br>島上有四座大廟：將軍廟、永安宮、天后宮、將軍禮拜堂。其中天后宮是由島民捐獻修建的寺廟，曾創下澎湖三最，花最多錢、擺最多流水席、最短時間完工，在此您可見精湛的石雕工藝。<br><br>在將軍嶼環島，可遠眺陸連島「船帆嶼」，為一座高約25公尺的玄武岩。上面設有一座涼亭，可在此悠閒放空，這陸連島也是海釣客的重要聚集地。',
          modalimg: './images/將軍嶼.jpg'
        },
        {
          img: './images/東嶼坪.jpg',
          html: '東嶼坪',
          title: '東嶼坪',
          text: '東嶼坪嶼為澎湖南方四島國家公園（註1）的四個主要島嶼之一，位在澎湖縣望安鄉東坪村的一個島嶼，與西嶼坪嶼相鄰；東嶼坪嶼是澎湖火山熔岩最後形成的島，大約在800萬年前。<br><br>位在望安嶼南方偏東，兩島相距約10海浬，其海域擁有覆蓋率極高的珊瑚、海地生態豐富繽紛，還有未經過度開發的陸上區域，保留以玄武岩、珊瑚礁岩所建造的澎湖厝、菜宅，還有繁盛時期的洋樓建築。<br><br>島嶼從中央分成南北長型路塊，四周多為陡峭海崖，北岸有數條蜿蜒的岩脈，南岸有大片綿延的沙灘地，西岸也有一處小沙灘。<br><br>聚落主要分不在西方和西南方的凹地，南北路塊邊坡都有佔地廣闊的菜宅（註2）、梯田，形成特殊的人文景觀。目前住戶居民不多，主要產業是觀光業與漁業；島上觀光可欣賞塔仔、陸連島、青蛙石、東嶼坪嶼聚落、梯田與菜宅、玄武岩節理景觀。<br><br>塔仔，港口碼頭的一塊巨岩，貌似關公像，幾乎全為裸露玄武岩，長期受海水與風化侵蝕，使得周圍岩石呈現土黃色。<br><br>陸連島，在南方海岸可見當地稱為「四仔角」的陸連島，其中一側有著廣闊的海蝕平台，上面佈滿多種潮間帶生物。<br><br>青蛙石，由玄武岩集塊岩組成，形似青蛙蹲踞狀。<br><br>東嶼坪嶼聚落，聚落分布在島上的南區、中區、北區，房厝多為傳統閩式建築，由南到北沿著山丘避風處逆向而行。<br><br>梯田與菜宅，在東嶼坪嶼南北兩陸塊中間，為避強勁的東北季風，在這裡可看到壯觀的梯田與菜宅遺跡，可以想見昔日農耕的最佳印證。<br><br>玄武岩節理景觀，在後山可見到海蝕溝、海蝕柱、海蝕洞等多樣地質景觀；以金龍塔為中心，左側有海蝕拱門，往海望去，可見海蝕溝地形，右側有因岩漿噴發冷卻時間不同而形成的柱狀與板狀兩種節理，在底下則為火山角礫岩層。<br><br>澎湖南方四島國家公園範圍內各島嶼資源有限，請遊客珍惜各項資源，並隨手將垃圾帶離島上，不增加島嶼負擔。<br><br>註1：澎湖南方四島包含望安鄉所轄東嶼坪嶼、西嶼坪嶼、東吉嶼、西吉嶼及其周邊島礁<br><br>註2：菜宅是一種四面都以玄武岩或是硓𥑮石砌牆的建築結構，可以抵檔強風，讓作物順利生長。',
          modalimg: './images/東嶼坪.jpg'
        },
        {
          img: './images/東吉嶼01.jpg',
          html: '東吉嶼',
          title: '東吉嶼',
          text: '東吉嶼，又名東吉島，台灣澎湖群島的一個島嶼，為台澎航道上的重要據點，行政區屬於澎湖縣望安鄉東吉村。此島（不含島嶼本身）至臺南市之海域屬於台江國家公園。至於島嶼部分，至2009年已有約1.34平方公里土地劃入澎湖南海玄武岩自然保留區。<br><br>東吉嶼戰略位置相當重要，自古即為台澎海運貿易的轉運站，曾經繁華一時。日治時代為確保台澎佔領權，分別在島上南北兩端興建軍營及燈塔，並派兵駐守，控制鄰近海域。當地居民放牧羊群，從北方的山頭俯眺，紅瓦白牆的古厝襯托著青草及黑白相間的羊群，景色頗為怡人。<br><br>東吉嶼西北側相距500公尺處為鋤頭嶼，是一座無人島。西方約4.5公里處有西吉嶼，原本有人居住，並設有一分校，但目前已成無人島。本島漲潮時面積為1.5423平方公里，退潮時面積為1.9045平方公里。',
          modalimg: './images/東吉嶼01.jpg'
        },
        {
          img: './images/藍洞.jpg',
          html: '西吉嶼',
          title: '西吉嶼',
          text: '西吉嶼，又名西吉島，台灣澎湖群島的一個島嶼，為台澎航道上的重要據點，行政區曾屬於澎湖縣望安鄉西吉村（已廢村）。現為澎湖南方四島海洋國家公園（包含東吉嶼、西吉嶼、東嶼坪嶼、西嶼坪嶼）的計畫。與東吉嶼相距約4.5公里。西吉因地處偏遠，交通不便，居民謀生困難，故人口銳減，於1978年7月1日政府輔導遷村。<br><br>而在2014年5月中旬，網路上瘋狂分享一張由台灣攝影師陳婉茹拍下的西吉嶼藍洞美景，讓這座被遺忘許久的小島爆紅，成為近年前往澎湖必去景點。有別於以往要包船才能前往，現在已經有遊艇業者規劃一系列行程，帶領旅客搭船近距離欣賞藍洞，尤其當正中午時，陽光直射海蝕洞上方洞口，讓下方海水因光線呈現碧藍色，宛如遺落仙境般。',
          modalimg: './images/藍洞.jpg'
        }
      ]
    }
  },
  methods: {
    hover (event) {
      this.show = (event)
    }
  }
}
</script>
